#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	// 除号/ 两端都是整数则进行整数除法结果也会是整数
//	// 除号两端有一个小数2.0则结果会是小数，用float数据接收
//	printf("%d\n", 9 / 2); // 4
//	float a = 9/2.0; // 4.500000
//	printf("%f",a);
//
//	// 除号% 取余数
//	printf("%d", 9 % 2);//1
//
//
//	return 0;
//}

//int main()
//{
//	//移位操作符<<>>
//	int a = 2;
//	int b = a << 1;
//	printf("%d", b);//4
//
//	//移位符移动的是二进制位，2的二进制是10
//	//a是整数占4字节，32比特也就是00000000000000000000000000000010
//	//左移一位就是00000000000000000000000000000100换算就是4
//	// 第一个零会废弃，末尾补零
//	//所以最后输出结果是4，>>同理
//
//	return 0;
//}

//int main()
//{
//	//位操作符  &与  |或  ^异或
//	// 赋值操作符= += -+ *= /= &= ^= <<= >>=
//	//单目操作符 ！ -  +（正负）  &  ~  --  ++  * 只有一个操作数
//	//0表示假 非0为真  若a=10 !a=0  若a=0 !a=1
//	//sizeof是一个操作符不是函数 括号可以省略，求类型（int long）时不能省略，变量时可以
//	//sizeof(arr)/sizeof(arr[0]),数组大小除以一个数占得字节可以求数组元素个数
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	printf("%d", ~a);//-1
//	return 0;
//}


//int main()
//{
//	int a = (int)3.14;
//	printf("%d", a);//整数接收小数报错
//	return 0;
//}











