//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//【程序1】 
//题目：有1、2、3、4个数字，能组成多少个互不相同且无
// 重复数字的三位数（意思就是没有像112，113）？都是多少？ 
// 1.程序分析：可填在百位、十位、个位的数字都是1、2、3、4。
// 组成所有的排列后再去掉不满足条件的排列。
//
//int main()
//{
//	int a, b, c ,sum= 0;
//	for (a = 1; a < 5; a++)
//	{
//		for (b = 1; b < 5; b++)
//		{
//			for (c = 1; c < 5; c++)
//			{
//				if (a != b && a != c && b != c)
//				{
//					printf("%d%d%d\n", a, b, c);
//					sum++;
//				}
//			}
//		}
//	}
//	printf("%d", sum);
//	return 0;
//}